package main

import "fmt"

// Одне яблуко коштує 5.99 грн. Ціна однієї груші - 7 грн.
// Ми маємо 23 грн.
// 1. Скільки грошей треба витратити, щоб купити 9 яблук та 8 груш?
// 2. Скільки груш ми можемо купити?
// 3. Скільки яблук ми можемо купити?
// 4. Чи ми можемо купити 2 груші та 2 яблука?
//
// Задача:
// Опишіть вирішення всіх пунктів задачі використовуючи необхідні змінні чи/та константи.
// Під опишіть, я маю на увазі наступне:
// Я маю збілдити ваш код і запустити програму. В результаті цього, я маю побачити роздруковані // відповіді на поставлені вище запитання. Перед відповідю треба роздрукувати саме питання.
// Правильно обирайте типи даних та назви змінних чи констант.
// Публікація:
// Створити папку в своєму репозиторії в github та завантажити туди main.go файл, в котрому буде зроблено дане завдання.

func main() {
	apple := 5.99
	pear := 7
	sum := 23
	//1)
	suma := 9*apple + 8*float64(pear)
	if suma > 0 {
		fmt.Println("Ціна 9 яблук та 8 груш = ", suma, "грн")
	}
	//2)
	var pearsCount int = int(sum / pear)
	fmt.Println("Кількість груш яку можна купити на", sum, "грн =", pearsCount)
	//3)
	var applesCount int = int(float64(sum) / apple)
	fmt.Println("Кількість яблук яку можна купити на", sum, "грн =", applesCount)
	//4
	var checkBuy = float64(sum) - (2*apple + 2*float64(pear))
	if checkBuy < 0 {
		fmt.Println("Ми не можемо купити 2 яблука та 2 груші за", sum, "грн")
	} else {
		fmt.Println("можемо купити 2 яблука та 2 груші за", sum, "грн")
	}

}
